Revit 2027 API
ParameterTypeId.RbsElecPanelTotalDemandCurrentParam Property
 "Total Estimated Demand Current"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsElecPanelTotalDemandCurrentParam { get; }
Public Shared ReadOnly Property RbsElecPanelTotalDemandCurrentParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsElecPanelTotalDemandCurrentParam {
	ForgeTypeId^ get ();
}
static member RbsElecPanelTotalDemandCurrentParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace